import { IPatchNotes } from '.';

export const notes: IPatchNotes = {
  version: '1.1.20201217-unstable.1',
  title: '1.1.20201217-unstable.1',
  notes: [
    '機能的にはv1.0.20201214-unstable.1から変化はありませんが、',
    'ニコニコ生放送のAPI(通信方法)の変更のため、スキップできないアップデートとなります。ご了承ください。',
    '',
    '参考: 最近の更新内容まとめ(v1.0.20201117-unstable.1～)',
    '詳しくはお知らせをご覧下さい。',
    '追加: エモーション情報をコメント一覧に表示する (#469)',
    '追加: ログイン画面にクリップボード操作のコンテキストメニューを追加 (#439)',
    '追加: クリップボードメニューを番組作成・編集画面にも追加する (#440)',
    '変更: 配信時に使用するニコ生のAPIを新しいものに変更, 配信番組選択ウィンドウを刷新 (#470)',
    '変更: NG追加した際に取得済みコメントを隠す (#444)'
  ]
};
